MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX270F512L.atdf
      <value-group caption="AN2 Pin Scan Selection bits" name="AD1CSSL__CSSL2">
         <value caption="Select AN2 for input scan; CSSL2 = AN2" name="" value="0x1" />
         <value caption="Skip AN2 for input scan; CSSL2 = AN2" name="" value="0x0" />
      </value-group>
      <value-group caption="AN3 Pin Scan Selection bits" name="AD1CSSL__CSSL3">
         <value caption="Select AN3 for input scan; CSSL3 = AN3" name="" value="0x1" />
         <value caption="Skip AN3 for input scan; CSSL3 = AN3" name="" value="0x0" />
      </value-group>
      <value-group caption="AN4 Pin Scan Selection bits" name="AD1CSSL__CSSL4">
         <value caption="Select AN4 for input scan; CSSL4 = AN4" name="" value="0x1" />
         <value caption="Skip AN4 for input scan; CSSL4 = AN4" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Pin Scan Selection bits" name="AD1CSSL__CSSL5">
         <value caption="Select AN5 for input scan; CSSL5 = AN5" name="" value="0x1" />
         <value caption="Skip AN5 for input scan; CSSL5 = AN5" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Pin Scan Selection bits" name="AD1CSSL__CSSL6">
         <value caption="Select AN6 for input scan; CSSL6 = AN6" name="" value="0x1" />
         <value caption="Skip AN6 for input scan; CSSL6 = AN6" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Pin Scan Selection bits" name="AD1CSSL__CSSL7">
         <value caption="Select AN7 for input scan; CSSL7 = AN7" name="" value="0x1" />
         <value caption="Skip AN7 for input scan; CSSL7 = AN7" name="" value="0x0" />
      </value-group>
      <value-group caption="AN8 Pin Scan Selection bits" name="AD1CSSL__CSSL8">
         <value caption="Select AN8 for input scan; CSSL8 = AN8" name="" value="0x1" />
         <value caption="Skip AN8 for input scan; CSSL8 = AN8" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Pin Scan Selection bits" name="AD1CSSL__CSSL9">
         <value caption="Select AN9 for input scan; CSSL9 = AN9" name="" value="0x1" />
         <value caption="Skip AN9 for input scan; CSSL9 = AN9" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Pin Scan Selection bits" name="AD1CSSL__CSSL10">
         <value caption="Select AN10 for input scan; CSSL10 = AN10" name="" value="0x1" />
         <value caption="Skip AN10 for input scan; CSSL10 = AN10" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Pin Scan Selection bits" name="AD1CSSL__CSSL11">
         <value caption="Select AN11 for input scan; CSSL11 = AN11" name="" value="0x1" />
         <value caption="Skip AN11 for input scan; CSSL11 = AN11" name="" value="0x0" />
      </value-group>
      <value-group caption="AN12 Pin Scan Selection bits" name="AD1CSSL__CSSL12">
         <value caption="Select AN12 for input scan; CSSL12 = AN12" name="" value="0x1" />
         <value caption="Skip AN12 for input scan; CSSL12 = AN12" name="" value="0x0" />
      </value-group>
      <value-group caption="AN13 Pin Scan Selection bits" name="AD1CSSL__CSSL13">
         <value caption="Select AN13 for input scan; CSSL13 = AN13" name="" value="0x1" />
         <value caption="Skip AN13 for input scan; CSSL13 = AN13" name="" value="0x0" />
      </value-group>
      <value-group caption="AN14 Pin Scan Selection bits" name="AD1CSSL__CSSL14">
         <value caption="Select AN14 for input scan; CSSL14 = AN14" name="" value="0x1" />
         <value caption="Skip AN14 for input scan; CSSL14 = AN14" name="" value="0x0" />
      </value-group>
      <value-group caption="AN15 Pin Scan Selection bits" name="AD1CSSL__CSSL15">
         <value caption="Select AN15 for input scan; CSSL15 = AN15" name="" value="0x1" />
         <value caption="Skip AN15 for input scan; CSSL15 = AN15" name="" value="0x0" />
      </value-group>
      <value-group caption="AN16 Pin Scan Selection bits" name="AD1CSSL__CSSL16">
         <value caption="Select AN16 for input scan; CSSL16 = AN16" name="" value="0x1" />
         <value caption="Skip AN16 for input scan; CSSL16 = AN16" name="" value="0x0" />
      </value-group>
      <value-group caption="AN17 Pin Scan Selection bits" name="AD1CSSL__CSSL17">
         <value caption="Select AN17 for input scan; CSSL17 = AN17" name="" value="0x1" />
         <value caption="Skip AN17 for input scan; CSSL17 = AN17" name="" value="0x0" />
      </value-group>
      <value-group caption="AN18 Pin Scan Selection bits" name="AD1CSSL__CSSL18">
         <value caption="Select AN18 for input scan; CSSL18 = AN18" name="" value="0x1" />
         <value caption="Skip AN18 for input scan; CSSL18 = AN18" name="" value="0x0" />
      </value-group>
      <value-group caption="AN19 Pin Scan Selection bits" name="AD1CSSL__CSSL19">
         <value caption="Select AN19 for input scan; CSSL19 = AN19" name="" value="0x1" />
         <value caption="Skip AN19 for input scan; CSSL19 = AN19" name="" value="0x0" />
      </value-group>
      <value-group caption="AN20 Pin Scan Selection bits" name="AD1CSSL__CSSL20">
         <value caption="Select AN20 for input scan; CSSL20 = AN20" name="" value="0x1" />
         <value caption="Skip AN20 for input scan; CSSL20 = AN20" name="" value="0x0" />
      </value-group>
      <value-group caption="AN21 Pin Scan Selection bits" name="AD1CSSL__CSSL21">
         <value caption="Select AN21 for input scan; CSSL21 = AN21" name="" value="0x1" />
         <value caption="Skip AN21 for input scan; CSSL21 = AN21" name="" value="0x0" />
      </value-group>
      <value-group caption="AN22 Pin Scan Selection bits" name="AD1CSSL__CSSL22">
         <value caption="Select AN22 for input scan; CSSL22 = AN22" name="" value="0x1" />
         <value caption="Skip AN22 for input scan; CSSL22 = AN22" name="" value="0x0" />
      </value-group>
      <value-group caption="AN23 Pin Scan Selection bits" name="AD1CSSL__CSSL23">
         <value caption="Select AN23 for input scan; CSSL23 = AN23" name="" value="0x1" />
         <value caption="Skip AN23 for input scan; CSSL23 = AN23" name="" value="0x0" />
      </value-group>
