MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX270F512L.atdf
         <register caption="" name="CNPUD" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUD" />
            <bitfield mask="0x00000002" name="CNPUD" />
            <bitfield mask="0x00000004" name="CNPUD" />
            <bitfield mask="0x00000008" name="CNPUD" />
            <bitfield mask="0x00000010" name="CNPUD" />
            <bitfield mask="0x00000020" name="CNPUD" />
            <bitfield mask="0x00000040" name="CNPUD" />
            <bitfield mask="0x00000080" name="CNPUD" />
            <bitfield mask="0x00000100" name="CNPUD" />
            <bitfield mask="0x00000200" name="CNPUD" />
            <bitfield mask="0x00000400" name="CNPUD" />
            <bitfield mask="0x00000800" name="CNPUD" />
            <bitfield mask="0x00001000" name="CNPUD" />
            <bitfield mask="0x00002000" name="CNPUD" />
            <bitfield mask="0x00004000" name="CNPUD" />
            <bitfield mask="0x00008000" name="CNPUD" />
         </register>
         <register caption="" name="CNPUE" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUE" />
            <bitfield mask="0x00000002" name="CNPUE" />
            <bitfield mask="0x00000004" name="CNPUE" />
            <bitfield mask="0x00000008" name="CNPUE" />
            <bitfield mask="0x00000010" name="CNPUE" />
            <bitfield mask="0x00000020" name="CNPUE" />
            <bitfield mask="0x00000040" name="CNPUE" />
            <bitfield mask="0x00000080" name="CNPUE" />
            <bitfield mask="0x00000100" name="CNPUE" />
            <bitfield mask="0x00000200" name="CNPUE" />
            <bitfield mask="0x00000400" name="CNPUE" />
            <bitfield mask="0x00000800" name="CNPUE" />
            <bitfield mask="0x00001000" name="CNPUE" />
            <bitfield mask="0x00002000" name="CNPUE" />
            <bitfield mask="0x00004000" name="CNPUE" />
            <bitfield mask="0x00008000" name="CNPUE" />
         </register>
         <register caption="" name="CNPUF" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUF" />
            <bitfield mask="0x00000002" name="CNPUF" />
            <bitfield mask="0x00000004" name="CNPUF" />
            <bitfield mask="0x00000008" name="CNPUF" />
            <bitfield mask="0x00000010" name="CNPUF" />
            <bitfield mask="0x00000020" name="CNPUF" />
            <bitfield mask="0x00000040" name="CNPUF" />
            <bitfield mask="0x00000080" name="CNPUF" />
            <bitfield mask="0x00000100" name="CNPUF" />
            <bitfield mask="0x00000200" name="CNPUF" />
            <bitfield mask="0x00000400" name="CNPUF" />
            <bitfield mask="0x00000800" name="CNPUF" />
            <bitfield mask="0x00001000" name="CNPUF" />
            <bitfield mask="0x00002000" name="CNPUF" />
            <bitfield mask="0x00004000" name="CNPUF" />
            <bitfield mask="0x00008000" name="CNPUF" />
         </register>
         <register caption="" name="CNPUG" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUG" />
            <bitfield mask="0x00000002" name="CNPUG" />
            <bitfield mask="0x00000004" name="CNPUG" />
            <bitfield mask="0x00000008" name="CNPUG" />
            <bitfield mask="0x00000010" name="CNPUG" />
            <bitfield mask="0x00000020" name="CNPUG" />
            <bitfield mask="0x00000040" name="CNPUG" />
            <bitfield mask="0x00000080" name="CNPUG" />
            <bitfield mask="0x00000100" name="CNPUG" />
            <bitfield mask="0x00000200" name="CNPUG" />
            <bitfield mask="0x00000400" name="CNPUG" />
            <bitfield mask="0x00000800" name="CNPUG" />
            <bitfield mask="0x00001000" name="CNPUG" />
            <bitfield mask="0x00002000" name="CNPUG" />
            <bitfield mask="0x00004000" name="CNPUG" />
            <bitfield mask="0x00008000" name="CNPUG" />
         </register>
         <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDA" />
            <bitfield mask="0x00000002" name="CNPDA" />
            <bitfield mask="0x00000004" name="CNPDA" />
            <bitfield mask="0x00000008" name="CNPDA" />
            <bitfield mask="0x00000010" name="CNPDA" />
            <bitfield mask="0x00000020" name="CNPDA" />
            <bitfield mask="0x00000040" name="CNPDA" />
            <bitfield mask="0x00000080" name="CNPDA" />
            <bitfield mask="0x00000100" name="CNPDA" />
            <bitfield mask="0x00000200" name="CNPDA" />
            <bitfield mask="0x00000400" name="CNPDA" />
            <bitfield mask="0x00000800" name="CNPDA" />
            <bitfield mask="0x00001000" name="CNPDA" />
            <bitfield mask="0x00002000" name="CNPDA" />
            <bitfield mask="0x00004000" name="CNPDA" />
            <bitfield mask="0x00008000" name="CNPDA" />
         </register>
         <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDB" />
            <bitfield mask="0x00000002" name="CNPDB" />
            <bitfield mask="0x00000004" name="CNPDB" />
            <bitfield mask="0x00000008" name="CNPDB" />
            <bitfield mask="0x00000010" name="CNPDB" />
            <bitfield mask="0x00000020" name="CNPDB" />
            <bitfield mask="0x00000040" name="CNPDB" />
            <bitfield mask="0x00000080" name="CNPDB" />
            <bitfield mask="0x00000100" name="CNPDB" />
            <bitfield mask="0x00000200" name="CNPDB" />
            <bitfield mask="0x00000400" name="CNPDB" />
            <bitfield mask="0x00000800" name="CNPDB" />
            <bitfield mask="0x00001000" name="CNPDB" />
            <bitfield mask="0x00002000" name="CNPDB" />
            <bitfield mask="0x00004000" name="CNPDB" />
            <bitfield mask="0x00008000" name="CNPDB" />
         </register>
         <register caption="" name="CNPDC" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDC" />
            <bitfield mask="0x00000002" name="CNPDC" />
            <bitfield mask="0x00000004" name="CNPDC" />
            <bitfield mask="0x00000008" name="CNPDC" />
            <bitfield mask="0x00000010" name="CNPDC" />
            <bitfield mask="0x00000020" name="CNPDC" />
            <bitfield mask="0x00000040" name="CNPDC" />
            <bitfield mask="0x00000080" name="CNPDC" />
            <bitfield mask="0x00000100" name="CNPDC" />
            <bitfield mask="0x00000200" name="CNPDC" />
            <bitfield mask="0x00000400" name="CNPDC" />
            <bitfield mask="0x00000800" name="CNPDC" />
            <bitfield mask="0x00001000" name="CNPDC" />
            <bitfield mask="0x00002000" name="CNPDC" />
            <bitfield mask="0x00004000" name="CNPDC" />
            <bitfield mask="0x00008000" name="CNPDC" />
         </register>
         <register caption="" name="CNPDD" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDD" />
            <bitfield mask="0x00000002" name="CNPDD" />
            <bitfield mask="0x00000004" name="CNPDD" />
            <bitfield mask="0x00000008" name="CNPDD" />
            <bitfield mask="0x00000010" name="CNPDD" />
            <bitfield mask="0x00000020" name="CNPDD" />
            <bitfield mask="0x00000040" name="CNPDD" />
            <bitfield mask="0x00000080" name="CNPDD" />
            <bitfield mask="0x00000100" name="CNPDD" />
            <bitfield mask="0x00000200" name="CNPDD" />
            <bitfield mask="0x00000400" name="CNPDD" />
            <bitfield mask="0x00000800" name="CNPDD" />
            <bitfield mask="0x00001000" name="CNPDD" />
            <bitfield mask="0x00002000" name="CNPDD" />
            <bitfield mask="0x00004000" name="CNPDD" />
            <bitfield mask="0x00008000" name="CNPDD" />
         </register>
         <register caption="" name="CNPDE" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDE" />
            <bitfield mask="0x00000002" name="CNPDE" />
            <bitfield mask="0x00000004" name="CNPDE" />
            <bitfield mask="0x00000008" name="CNPDE" />
            <bitfield mask="0x00000010" name="CNPDE" />
            <bitfield mask="0x00000020" name="CNPDE" />
            <bitfield mask="0x00000040" name="CNPDE" />
            <bitfield mask="0x00000080" name="CNPDE" />
            <bitfield mask="0x00000100" name="CNPDE" />
            <bitfield mask="0x00000200" name="CNPDE" />
            <bitfield mask="0x00000400" name="CNPDE" />
            <bitfield mask="0x00000800" name="CNPDE" />
            <bitfield mask="0x00001000" name="CNPDE" />
            <bitfield mask="0x00002000" name="CNPDE" />
            <bitfield mask="0x00004000" name="CNPDE" />
            <bitfield mask="0x00008000" name="CNPDE" />
         </register>
         <register caption="" name="CNPDF" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDF" />
            <bitfield mask="0x00000002" name="CNPDF" />
            <bitfield mask="0x00000004" name="CNPDF" />
            <bitfield mask="0x00000008" name="CNPDF" />
            <bitfield mask="0x00000010" name="CNPDF" />
            <bitfield mask="0x00000020" name="CNPDF" />
            <bitfield mask="0x00000040" name="CNPDF" />
            <bitfield mask="0x00000080" name="CNPDF" />
            <bitfield mask="0x00000100" name="CNPDF" />
            <bitfield mask="0x00000200" name="CNPDF" />
            <bitfield mask="0x00000400" name="CNPDF" />
            <bitfield mask="0x00000800" name="CNPDF" />
            <bitfield mask="0x00001000" name="CNPDF" />
            <bitfield mask="0x00002000" name="CNPDF" />
            <bitfield mask="0x00004000" name="CNPDF" />
            <bitfield mask="0x00008000" name="CNPDF" />
         </register>
         <register caption="" name="CNPDG" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDG" />
            <bitfield mask="0x00000002" name="CNPDG" />
            <bitfield mask="0x00000004" name="CNPDG" />
            <bitfield mask="0x00000008" name="CNPDG" />
            <bitfield mask="0x00000010" name="CNPDG" />
            <bitfield mask="0x00000020" name="CNPDG" />
            <bitfield mask="0x00000040" name="CNPDG" />
            <bitfield mask="0x00000080" name="CNPDG" />
            <bitfield mask="0x00000100" name="CNPDG" />
            <bitfield mask="0x00000200" name="CNPDG" />
            <bitfield mask="0x00000400" name="CNPDG" />
            <bitfield mask="0x00000800" name="CNPDG" />
            <bitfield mask="0x00001000" name="CNPDG" />
            <bitfield mask="0x00002000" name="CNPDG" />
            <bitfield mask="0x00004000" name="CNPDG" />
            <bitfield mask="0x00008000" name="CNPDG" />
         </register>
         <register caption="" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONC" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCOND" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONE" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONF" offset="0x570" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONG" offset="0x670" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
